@echo off
chcp 65001 > nul
echo ========================================================
echo  سامانه هوشمند تجمیع خودکار و صدور تصویر کارنامه نواحی نسرا
echo ========================================================
echo.
echo در حال بررسی پیش نیازها و نصب کتابخانه های لازم...
python -m pip install openpyxl pillow arabic-reshaper python-bidi --quiet
echo در حال استخراج داده ها و تولید تصاویر کارنامه ها...
python تجمیع_خودکار_نواحی.py
echo.
echo ========================================================
pause
